Revit.Elements.AbstractFamilyInstance
An abstract Revit FamilyInstance - implementors include FamilyInstance, AdaptiveComponent, StructuralFraming

Revit.Elements.AbstractFamilyInstance.InternalFamilyInstance
Reference to the Element

Revit.Elements.AbstractFamilyInstance.InternalElement
Reference to the Element